Codebase/PRISM_611/prism-web/src/main/resources/test.xml

<?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><ns2:loadStudentData xmlns:ns2="http://controller.web.prism.ctb.com/"><StudentListTO><rosterDetailsTO><custHierarchyDetailsTO><collOrgDetailsTO><orgCode>000000001</orgCode><orgLabel>State</orgLabel><orgLevel>1</orgLevel><orgName>AD - TASC QA 1</orgName><orgNodeId>497934</orgNodeId><parentOrgCode>0</parentOrgCode></collOrgDetailsTO><collOrgDetailsTO><orgCode>50000001</orgCode><orgLabel>County</orgLabel><orgLevel>2</orgLevel><orgName>County4</orgName><orgNodeId>497935</orgNodeId><parentOrgCode>000000001</parentOrgCode></collOrgDetailsTO><collOrgDetailsTO><orgCode>300000006</orgCode><orgLabel>Testing Site</orgLabel><orgLevel>3</orgLevel><orgName>ARIF    Site2</orgName><orgNodeId>497940</orgNodeId><parentOrgCode>50000001</parentOrgCode></collOrgDetailsTO><customerId>14829</customerId><dataChanged>true</dataChanged><maxHierarchy>3</maxHierarchy><testName>TASC</testName></custHierarchyDetailsTO><rosterId>7323915</rosterId><studentDetailsTO><studentBioTO><birthDate>010695</birthDate><chrnlgclAge>19</chrnlgclAge><dataChanged>true</dataChanged><examineeId>310442347</examineeId><firstName>FT ONLY</firstName><gender>M</gender><grade>AD</grade><lastName>OLLOMTS0145</lastName><middleInit>O</middleInit><oasStudentId>12699992</oasStudentId></studentBioTO><studentDemoTO><collDemoTO><demoName>Test_Form</demoName><demovalue>C</demovalue></collDemoTO><collDemoTO><demoName>Fld_Tst_Form</demoName><demovalue>C1</demovalue></collDemoTO><collDemoTO><demoName>Tst_Platform</demoName><demovalue>0</demovalue></collDemoTO><collDemoTO><demoName>Test_Lan</demoName><demovalue>E</demovalue></collDemoTO><dataChanged>true</dataChanged></studentDemoTO></studentDetailsTO></rosterDetailsTO></StudentListTO></ns2:loadStudentData></S:Body></S:Envelope>